----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 30, 28, 28]             270
       BatchNorm2d-2           [-1, 30, 28, 28]              60
            Conv2d-3           [-1, 60, 28, 28]           1,800
       BatchNorm2d-4           [-1, 60, 28, 28]             120
            Conv2d-5           [-1, 15, 28, 28]           8,100
        Bottleneck-6           [-1, 45, 28, 28]               0
       BatchNorm2d-7           [-1, 45, 28, 28]              90
            Conv2d-8           [-1, 60, 28, 28]           2,700
       BatchNorm2d-9           [-1, 60, 28, 28]             120
           Conv2d-10           [-1, 15, 28, 28]           8,100
       Bottleneck-11           [-1, 60, 28, 28]               0
      BatchNorm2d-12           [-1, 60, 28, 28]             120
           Conv2d-13           [-1, 60, 28, 28]           3,600
      BatchNorm2d-14           [-1, 60, 28, 28]             120
           Conv2d-15           [-1, 15, 28, 28]           8,100
       Bottleneck-16           [-1, 75, 28, 28]               0
      BatchNorm2d-17           [-1, 75, 28, 28]             150
           Conv2d-18           [-1, 60, 28, 28]           4,500
      BatchNorm2d-19           [-1, 60, 28, 28]             120
           Conv2d-20           [-1, 15, 28, 28]           8,100
       Bottleneck-21           [-1, 90, 28, 28]               0
      BatchNorm2d-22           [-1, 90, 28, 28]             180
           Conv2d-23           [-1, 60, 28, 28]           5,400
      BatchNorm2d-24           [-1, 60, 28, 28]             120
           Conv2d-25           [-1, 15, 28, 28]           8,100
       Bottleneck-26          [-1, 105, 28, 28]               0
      BatchNorm2d-27          [-1, 105, 28, 28]             210
           Conv2d-28           [-1, 60, 28, 28]           6,300
      BatchNorm2d-29           [-1, 60, 28, 28]             120
           Conv2d-30           [-1, 15, 28, 28]           8,100
       Bottleneck-31          [-1, 120, 28, 28]               0
      BatchNorm2d-32          [-1, 120, 28, 28]             240
           Conv2d-33           [-1, 60, 28, 28]           7,200
      BatchNorm2d-34           [-1, 60, 28, 28]             120
           Conv2d-35           [-1, 15, 28, 28]           8,100
       Bottleneck-36          [-1, 135, 28, 28]               0
      BatchNorm2d-37          [-1, 135, 28, 28]             270
           Conv2d-38           [-1, 60, 28, 28]           8,100
      BatchNorm2d-39           [-1, 60, 28, 28]             120
           Conv2d-40           [-1, 15, 28, 28]           8,100
       Bottleneck-41          [-1, 150, 28, 28]               0
      BatchNorm2d-42          [-1, 150, 28, 28]             300
           Conv2d-43           [-1, 60, 28, 28]           9,000
      BatchNorm2d-44           [-1, 60, 28, 28]             120
           Conv2d-45           [-1, 15, 28, 28]           8,100
       Bottleneck-46          [-1, 165, 28, 28]               0
      BatchNorm2d-47          [-1, 165, 28, 28]             330
           Conv2d-48           [-1, 60, 28, 28]           9,900
      BatchNorm2d-49           [-1, 60, 28, 28]             120
           Conv2d-50           [-1, 15, 28, 28]           8,100
       Bottleneck-51          [-1, 180, 28, 28]               0
      BatchNorm2d-52          [-1, 180, 28, 28]             360
           Conv2d-53           [-1, 60, 28, 28]          10,800
      BatchNorm2d-54           [-1, 60, 28, 28]             120
           Conv2d-55           [-1, 15, 28, 28]           8,100
       Bottleneck-56          [-1, 195, 28, 28]               0
      BatchNorm2d-57          [-1, 195, 28, 28]             390
           Conv2d-58           [-1, 60, 28, 28]          11,700
      BatchNorm2d-59           [-1, 60, 28, 28]             120
           Conv2d-60           [-1, 15, 28, 28]           8,100
       Bottleneck-61          [-1, 210, 28, 28]               0
      BatchNorm2d-62          [-1, 210, 28, 28]             420
           Conv2d-63           [-1, 60, 28, 28]          12,600
      BatchNorm2d-64           [-1, 60, 28, 28]             120
           Conv2d-65           [-1, 15, 28, 28]           8,100
       Bottleneck-66          [-1, 225, 28, 28]               0
      BatchNorm2d-67          [-1, 225, 28, 28]             450
           Conv2d-68           [-1, 60, 28, 28]          13,500
      BatchNorm2d-69           [-1, 60, 28, 28]             120
           Conv2d-70           [-1, 15, 28, 28]           8,100
       Bottleneck-71          [-1, 240, 28, 28]               0
      BatchNorm2d-72          [-1, 240, 28, 28]             480
           Conv2d-73           [-1, 60, 28, 28]          14,400
      BatchNorm2d-74           [-1, 60, 28, 28]             120
           Conv2d-75           [-1, 15, 28, 28]           8,100
       Bottleneck-76          [-1, 255, 28, 28]               0
      BatchNorm2d-77          [-1, 255, 28, 28]             510
           Conv2d-78           [-1, 60, 28, 28]          15,300
      BatchNorm2d-79           [-1, 60, 28, 28]             120
           Conv2d-80           [-1, 15, 28, 28]           8,100
       Bottleneck-81          [-1, 270, 28, 28]               0
      BatchNorm2d-82          [-1, 270, 28, 28]             540
           Conv2d-83          [-1, 135, 28, 28]          36,450
       Transition-84          [-1, 135, 14, 14]               0
      BatchNorm2d-85          [-1, 135, 14, 14]             270
           Conv2d-86           [-1, 60, 14, 14]           8,100
      BatchNorm2d-87           [-1, 60, 14, 14]             120
           Conv2d-88           [-1, 15, 14, 14]           8,100
       Bottleneck-89          [-1, 150, 14, 14]               0
      BatchNorm2d-90          [-1, 150, 14, 14]             300
           Conv2d-91           [-1, 60, 14, 14]           9,000
      BatchNorm2d-92           [-1, 60, 14, 14]             120
           Conv2d-93           [-1, 15, 14, 14]           8,100
       Bottleneck-94          [-1, 165, 14, 14]               0
      BatchNorm2d-95          [-1, 165, 14, 14]             330
           Conv2d-96           [-1, 60, 14, 14]           9,900
      BatchNorm2d-97           [-1, 60, 14, 14]             120
           Conv2d-98           [-1, 15, 14, 14]           8,100
       Bottleneck-99          [-1, 180, 14, 14]               0
     BatchNorm2d-100          [-1, 180, 14, 14]             360
          Conv2d-101           [-1, 60, 14, 14]          10,800
     BatchNorm2d-102           [-1, 60, 14, 14]             120
          Conv2d-103           [-1, 15, 14, 14]           8,100
      Bottleneck-104          [-1, 195, 14, 14]               0
     BatchNorm2d-105          [-1, 195, 14, 14]             390
          Conv2d-106           [-1, 60, 14, 14]          11,700
     BatchNorm2d-107           [-1, 60, 14, 14]             120
          Conv2d-108           [-1, 15, 14, 14]           8,100
      Bottleneck-109          [-1, 210, 14, 14]               0
     BatchNorm2d-110          [-1, 210, 14, 14]             420
          Conv2d-111           [-1, 60, 14, 14]          12,600
     BatchNorm2d-112           [-1, 60, 14, 14]             120
          Conv2d-113           [-1, 15, 14, 14]           8,100
      Bottleneck-114          [-1, 225, 14, 14]               0
     BatchNorm2d-115          [-1, 225, 14, 14]             450
          Conv2d-116           [-1, 60, 14, 14]          13,500
     BatchNorm2d-117           [-1, 60, 14, 14]             120
          Conv2d-118           [-1, 15, 14, 14]           8,100
      Bottleneck-119          [-1, 240, 14, 14]               0
     BatchNorm2d-120          [-1, 240, 14, 14]             480
          Conv2d-121           [-1, 60, 14, 14]          14,400
     BatchNorm2d-122           [-1, 60, 14, 14]             120
          Conv2d-123           [-1, 15, 14, 14]           8,100
      Bottleneck-124          [-1, 255, 14, 14]               0
     BatchNorm2d-125          [-1, 255, 14, 14]             510
          Conv2d-126           [-1, 60, 14, 14]          15,300
     BatchNorm2d-127           [-1, 60, 14, 14]             120
          Conv2d-128           [-1, 15, 14, 14]           8,100
      Bottleneck-129          [-1, 270, 14, 14]               0
     BatchNorm2d-130          [-1, 270, 14, 14]             540
          Conv2d-131           [-1, 60, 14, 14]          16,200
     BatchNorm2d-132           [-1, 60, 14, 14]             120
          Conv2d-133           [-1, 15, 14, 14]           8,100
      Bottleneck-134          [-1, 285, 14, 14]               0
     BatchNorm2d-135          [-1, 285, 14, 14]             570
          Conv2d-136           [-1, 60, 14, 14]          17,100
     BatchNorm2d-137           [-1, 60, 14, 14]             120
          Conv2d-138           [-1, 15, 14, 14]           8,100
      Bottleneck-139          [-1, 300, 14, 14]               0
     BatchNorm2d-140          [-1, 300, 14, 14]             600
          Conv2d-141           [-1, 60, 14, 14]          18,000
     BatchNorm2d-142           [-1, 60, 14, 14]             120
          Conv2d-143           [-1, 15, 14, 14]           8,100
      Bottleneck-144          [-1, 315, 14, 14]               0
     BatchNorm2d-145          [-1, 315, 14, 14]             630
          Conv2d-146           [-1, 60, 14, 14]          18,900
     BatchNorm2d-147           [-1, 60, 14, 14]             120
          Conv2d-148           [-1, 15, 14, 14]           8,100
      Bottleneck-149          [-1, 330, 14, 14]               0
     BatchNorm2d-150          [-1, 330, 14, 14]             660
          Conv2d-151           [-1, 60, 14, 14]          19,800
     BatchNorm2d-152           [-1, 60, 14, 14]             120
          Conv2d-153           [-1, 15, 14, 14]           8,100
      Bottleneck-154          [-1, 345, 14, 14]               0
     BatchNorm2d-155          [-1, 345, 14, 14]             690
          Conv2d-156           [-1, 60, 14, 14]          20,700
     BatchNorm2d-157           [-1, 60, 14, 14]             120
          Conv2d-158           [-1, 15, 14, 14]           8,100
      Bottleneck-159          [-1, 360, 14, 14]               0
     BatchNorm2d-160          [-1, 360, 14, 14]             720
          Conv2d-161           [-1, 60, 14, 14]          21,600
     BatchNorm2d-162           [-1, 60, 14, 14]             120
          Conv2d-163           [-1, 15, 14, 14]           8,100
      Bottleneck-164          [-1, 375, 14, 14]               0
     BatchNorm2d-165          [-1, 375, 14, 14]             750
          Conv2d-166          [-1, 187, 14, 14]          70,125
      Transition-167            [-1, 187, 7, 7]               0
     BatchNorm2d-168            [-1, 187, 7, 7]             374
          Conv2d-169             [-1, 60, 7, 7]          11,220
     BatchNorm2d-170             [-1, 60, 7, 7]             120
          Conv2d-171             [-1, 15, 7, 7]           8,100
      Bottleneck-172            [-1, 202, 7, 7]               0
     BatchNorm2d-173            [-1, 202, 7, 7]             404
          Conv2d-174             [-1, 60, 7, 7]          12,120
     BatchNorm2d-175             [-1, 60, 7, 7]             120
          Conv2d-176             [-1, 15, 7, 7]           8,100
      Bottleneck-177            [-1, 217, 7, 7]               0
     BatchNorm2d-178            [-1, 217, 7, 7]             434
          Conv2d-179             [-1, 60, 7, 7]          13,020
     BatchNorm2d-180             [-1, 60, 7, 7]             120
          Conv2d-181             [-1, 15, 7, 7]           8,100
      Bottleneck-182            [-1, 232, 7, 7]               0
     BatchNorm2d-183            [-1, 232, 7, 7]             464
          Conv2d-184             [-1, 60, 7, 7]          13,920
     BatchNorm2d-185             [-1, 60, 7, 7]             120
          Conv2d-186             [-1, 15, 7, 7]           8,100
      Bottleneck-187            [-1, 247, 7, 7]               0
     BatchNorm2d-188            [-1, 247, 7, 7]             494
          Conv2d-189             [-1, 60, 7, 7]          14,820
     BatchNorm2d-190             [-1, 60, 7, 7]             120
          Conv2d-191             [-1, 15, 7, 7]           8,100
      Bottleneck-192            [-1, 262, 7, 7]               0
     BatchNorm2d-193            [-1, 262, 7, 7]             524
          Conv2d-194             [-1, 60, 7, 7]          15,720
     BatchNorm2d-195             [-1, 60, 7, 7]             120
          Conv2d-196             [-1, 15, 7, 7]           8,100
      Bottleneck-197            [-1, 277, 7, 7]               0
     BatchNorm2d-198            [-1, 277, 7, 7]             554
          Conv2d-199             [-1, 60, 7, 7]          16,620
     BatchNorm2d-200             [-1, 60, 7, 7]             120
          Conv2d-201             [-1, 15, 7, 7]           8,100
      Bottleneck-202            [-1, 292, 7, 7]               0
     BatchNorm2d-203            [-1, 292, 7, 7]             584
          Conv2d-204             [-1, 60, 7, 7]          17,520
     BatchNorm2d-205             [-1, 60, 7, 7]             120
          Conv2d-206             [-1, 15, 7, 7]           8,100
      Bottleneck-207            [-1, 307, 7, 7]               0
     BatchNorm2d-208            [-1, 307, 7, 7]             614
          Conv2d-209             [-1, 60, 7, 7]          18,420
     BatchNorm2d-210             [-1, 60, 7, 7]             120
          Conv2d-211             [-1, 15, 7, 7]           8,100
      Bottleneck-212            [-1, 322, 7, 7]               0
     BatchNorm2d-213            [-1, 322, 7, 7]             644
          Conv2d-214             [-1, 60, 7, 7]          19,320
     BatchNorm2d-215             [-1, 60, 7, 7]             120
          Conv2d-216             [-1, 15, 7, 7]           8,100
      Bottleneck-217            [-1, 337, 7, 7]               0
     BatchNorm2d-218            [-1, 337, 7, 7]             674
          Conv2d-219             [-1, 60, 7, 7]          20,220
     BatchNorm2d-220             [-1, 60, 7, 7]             120
          Conv2d-221             [-1, 15, 7, 7]           8,100
      Bottleneck-222            [-1, 352, 7, 7]               0
     BatchNorm2d-223            [-1, 352, 7, 7]             704
          Conv2d-224             [-1, 60, 7, 7]          21,120
     BatchNorm2d-225             [-1, 60, 7, 7]             120
          Conv2d-226             [-1, 15, 7, 7]           8,100
      Bottleneck-227            [-1, 367, 7, 7]               0
     BatchNorm2d-228            [-1, 367, 7, 7]             734
          Conv2d-229             [-1, 60, 7, 7]          22,020
     BatchNorm2d-230             [-1, 60, 7, 7]             120
          Conv2d-231             [-1, 15, 7, 7]           8,100
      Bottleneck-232            [-1, 382, 7, 7]               0
     BatchNorm2d-233            [-1, 382, 7, 7]             764
          Conv2d-234             [-1, 60, 7, 7]          22,920
     BatchNorm2d-235             [-1, 60, 7, 7]             120
          Conv2d-236             [-1, 15, 7, 7]           8,100
      Bottleneck-237            [-1, 397, 7, 7]               0
     BatchNorm2d-238            [-1, 397, 7, 7]             794
          Conv2d-239             [-1, 60, 7, 7]          23,820
     BatchNorm2d-240             [-1, 60, 7, 7]             120
          Conv2d-241             [-1, 15, 7, 7]           8,100
      Bottleneck-242            [-1, 412, 7, 7]               0
     BatchNorm2d-243            [-1, 412, 7, 7]             824
          Conv2d-244             [-1, 60, 7, 7]          24,720
     BatchNorm2d-245             [-1, 60, 7, 7]             120
          Conv2d-246             [-1, 15, 7, 7]           8,100
      Bottleneck-247            [-1, 427, 7, 7]               0
     BatchNorm2d-248            [-1, 427, 7, 7]             854
          Linear-249                   [-1, 10]           4,280
================================================================
Total params: 1,191,813
Trainable params: 1,191,813
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 65.42
Params size (MB): 4.55
Estimated Total Size (MB): 69.97
----------------------------------------------------------------
