----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 24, 28, 28]             216
       BatchNorm2d-2           [-1, 24, 28, 28]              48
            Conv2d-3           [-1, 48, 28, 28]           1,152
       BatchNorm2d-4           [-1, 48, 28, 28]              96
            Conv2d-5           [-1, 12, 28, 28]           5,184
        Bottleneck-6           [-1, 36, 28, 28]               0
       BatchNorm2d-7           [-1, 36, 28, 28]              72
            Conv2d-8           [-1, 48, 28, 28]           1,728
       BatchNorm2d-9           [-1, 48, 28, 28]              96
           Conv2d-10           [-1, 12, 28, 28]           5,184
       Bottleneck-11           [-1, 48, 28, 28]               0
      BatchNorm2d-12           [-1, 48, 28, 28]              96
           Conv2d-13           [-1, 48, 28, 28]           2,304
      BatchNorm2d-14           [-1, 48, 28, 28]              96
           Conv2d-15           [-1, 12, 28, 28]           5,184
       Bottleneck-16           [-1, 60, 28, 28]               0
      BatchNorm2d-17           [-1, 60, 28, 28]             120
           Conv2d-18           [-1, 48, 28, 28]           2,880
      BatchNorm2d-19           [-1, 48, 28, 28]              96
           Conv2d-20           [-1, 12, 28, 28]           5,184
       Bottleneck-21           [-1, 72, 28, 28]               0
      BatchNorm2d-22           [-1, 72, 28, 28]             144
           Conv2d-23           [-1, 48, 28, 28]           3,456
      BatchNorm2d-24           [-1, 48, 28, 28]              96
           Conv2d-25           [-1, 12, 28, 28]           5,184
       Bottleneck-26           [-1, 84, 28, 28]               0
      BatchNorm2d-27           [-1, 84, 28, 28]             168
           Conv2d-28           [-1, 48, 28, 28]           4,032
      BatchNorm2d-29           [-1, 48, 28, 28]              96
           Conv2d-30           [-1, 12, 28, 28]           5,184
       Bottleneck-31           [-1, 96, 28, 28]               0
      BatchNorm2d-32           [-1, 96, 28, 28]             192
           Conv2d-33           [-1, 48, 28, 28]           4,608
      BatchNorm2d-34           [-1, 48, 28, 28]              96
           Conv2d-35           [-1, 12, 28, 28]           5,184
       Bottleneck-36          [-1, 108, 28, 28]               0
      BatchNorm2d-37          [-1, 108, 28, 28]             216
           Conv2d-38           [-1, 48, 28, 28]           5,184
      BatchNorm2d-39           [-1, 48, 28, 28]              96
           Conv2d-40           [-1, 12, 28, 28]           5,184
       Bottleneck-41          [-1, 120, 28, 28]               0
      BatchNorm2d-42          [-1, 120, 28, 28]             240
           Conv2d-43           [-1, 48, 28, 28]           5,760
      BatchNorm2d-44           [-1, 48, 28, 28]              96
           Conv2d-45           [-1, 12, 28, 28]           5,184
       Bottleneck-46          [-1, 132, 28, 28]               0
      BatchNorm2d-47          [-1, 132, 28, 28]             264
           Conv2d-48           [-1, 48, 28, 28]           6,336
      BatchNorm2d-49           [-1, 48, 28, 28]              96
           Conv2d-50           [-1, 12, 28, 28]           5,184
       Bottleneck-51          [-1, 144, 28, 28]               0
      BatchNorm2d-52          [-1, 144, 28, 28]             288
           Conv2d-53           [-1, 48, 28, 28]           6,912
      BatchNorm2d-54           [-1, 48, 28, 28]              96
           Conv2d-55           [-1, 12, 28, 28]           5,184
       Bottleneck-56          [-1, 156, 28, 28]               0
      BatchNorm2d-57          [-1, 156, 28, 28]             312
           Conv2d-58           [-1, 48, 28, 28]           7,488
      BatchNorm2d-59           [-1, 48, 28, 28]              96
           Conv2d-60           [-1, 12, 28, 28]           5,184
       Bottleneck-61          [-1, 168, 28, 28]               0
      BatchNorm2d-62          [-1, 168, 28, 28]             336
           Conv2d-63           [-1, 48, 28, 28]           8,064
      BatchNorm2d-64           [-1, 48, 28, 28]              96
           Conv2d-65           [-1, 12, 28, 28]           5,184
       Bottleneck-66          [-1, 180, 28, 28]               0
      BatchNorm2d-67          [-1, 180, 28, 28]             360
           Conv2d-68           [-1, 48, 28, 28]           8,640
      BatchNorm2d-69           [-1, 48, 28, 28]              96
           Conv2d-70           [-1, 12, 28, 28]           5,184
       Bottleneck-71          [-1, 192, 28, 28]               0
      BatchNorm2d-72          [-1, 192, 28, 28]             384
           Conv2d-73           [-1, 48, 28, 28]           9,216
      BatchNorm2d-74           [-1, 48, 28, 28]              96
           Conv2d-75           [-1, 12, 28, 28]           5,184
       Bottleneck-76          [-1, 204, 28, 28]               0
      BatchNorm2d-77          [-1, 204, 28, 28]             408
           Conv2d-78           [-1, 48, 28, 28]           9,792
      BatchNorm2d-79           [-1, 48, 28, 28]              96
           Conv2d-80           [-1, 12, 28, 28]           5,184
       Bottleneck-81          [-1, 216, 28, 28]               0
      BatchNorm2d-82          [-1, 216, 28, 28]             432
           Conv2d-83          [-1, 108, 28, 28]          23,328
       Transition-84          [-1, 108, 14, 14]               0
      BatchNorm2d-85          [-1, 108, 14, 14]             216
           Conv2d-86           [-1, 48, 14, 14]           5,184
      BatchNorm2d-87           [-1, 48, 14, 14]              96
           Conv2d-88           [-1, 12, 14, 14]           5,184
       Bottleneck-89          [-1, 120, 14, 14]               0
      BatchNorm2d-90          [-1, 120, 14, 14]             240
           Conv2d-91           [-1, 48, 14, 14]           5,760
      BatchNorm2d-92           [-1, 48, 14, 14]              96
           Conv2d-93           [-1, 12, 14, 14]           5,184
       Bottleneck-94          [-1, 132, 14, 14]               0
      BatchNorm2d-95          [-1, 132, 14, 14]             264
           Conv2d-96           [-1, 48, 14, 14]           6,336
      BatchNorm2d-97           [-1, 48, 14, 14]              96
           Conv2d-98           [-1, 12, 14, 14]           5,184
       Bottleneck-99          [-1, 144, 14, 14]               0
     BatchNorm2d-100          [-1, 144, 14, 14]             288
          Conv2d-101           [-1, 48, 14, 14]           6,912
     BatchNorm2d-102           [-1, 48, 14, 14]              96
          Conv2d-103           [-1, 12, 14, 14]           5,184
      Bottleneck-104          [-1, 156, 14, 14]               0
     BatchNorm2d-105          [-1, 156, 14, 14]             312
          Conv2d-106           [-1, 48, 14, 14]           7,488
     BatchNorm2d-107           [-1, 48, 14, 14]              96
          Conv2d-108           [-1, 12, 14, 14]           5,184
      Bottleneck-109          [-1, 168, 14, 14]               0
     BatchNorm2d-110          [-1, 168, 14, 14]             336
          Conv2d-111           [-1, 48, 14, 14]           8,064
     BatchNorm2d-112           [-1, 48, 14, 14]              96
          Conv2d-113           [-1, 12, 14, 14]           5,184
      Bottleneck-114          [-1, 180, 14, 14]               0
     BatchNorm2d-115          [-1, 180, 14, 14]             360
          Conv2d-116           [-1, 48, 14, 14]           8,640
     BatchNorm2d-117           [-1, 48, 14, 14]              96
          Conv2d-118           [-1, 12, 14, 14]           5,184
      Bottleneck-119          [-1, 192, 14, 14]               0
     BatchNorm2d-120          [-1, 192, 14, 14]             384
          Conv2d-121           [-1, 48, 14, 14]           9,216
     BatchNorm2d-122           [-1, 48, 14, 14]              96
          Conv2d-123           [-1, 12, 14, 14]           5,184
      Bottleneck-124          [-1, 204, 14, 14]               0
     BatchNorm2d-125          [-1, 204, 14, 14]             408
          Conv2d-126           [-1, 48, 14, 14]           9,792
     BatchNorm2d-127           [-1, 48, 14, 14]              96
          Conv2d-128           [-1, 12, 14, 14]           5,184
      Bottleneck-129          [-1, 216, 14, 14]               0
     BatchNorm2d-130          [-1, 216, 14, 14]             432
          Conv2d-131           [-1, 48, 14, 14]          10,368
     BatchNorm2d-132           [-1, 48, 14, 14]              96
          Conv2d-133           [-1, 12, 14, 14]           5,184
      Bottleneck-134          [-1, 228, 14, 14]               0
     BatchNorm2d-135          [-1, 228, 14, 14]             456
          Conv2d-136           [-1, 48, 14, 14]          10,944
     BatchNorm2d-137           [-1, 48, 14, 14]              96
          Conv2d-138           [-1, 12, 14, 14]           5,184
      Bottleneck-139          [-1, 240, 14, 14]               0
     BatchNorm2d-140          [-1, 240, 14, 14]             480
          Conv2d-141           [-1, 48, 14, 14]          11,520
     BatchNorm2d-142           [-1, 48, 14, 14]              96
          Conv2d-143           [-1, 12, 14, 14]           5,184
      Bottleneck-144          [-1, 252, 14, 14]               0
     BatchNorm2d-145          [-1, 252, 14, 14]             504
          Conv2d-146           [-1, 48, 14, 14]          12,096
     BatchNorm2d-147           [-1, 48, 14, 14]              96
          Conv2d-148           [-1, 12, 14, 14]           5,184
      Bottleneck-149          [-1, 264, 14, 14]               0
     BatchNorm2d-150          [-1, 264, 14, 14]             528
          Conv2d-151           [-1, 48, 14, 14]          12,672
     BatchNorm2d-152           [-1, 48, 14, 14]              96
          Conv2d-153           [-1, 12, 14, 14]           5,184
      Bottleneck-154          [-1, 276, 14, 14]               0
     BatchNorm2d-155          [-1, 276, 14, 14]             552
          Conv2d-156           [-1, 48, 14, 14]          13,248
     BatchNorm2d-157           [-1, 48, 14, 14]              96
          Conv2d-158           [-1, 12, 14, 14]           5,184
      Bottleneck-159          [-1, 288, 14, 14]               0
     BatchNorm2d-160          [-1, 288, 14, 14]             576
          Conv2d-161           [-1, 48, 14, 14]          13,824
     BatchNorm2d-162           [-1, 48, 14, 14]              96
          Conv2d-163           [-1, 12, 14, 14]           5,184
      Bottleneck-164          [-1, 300, 14, 14]               0
     BatchNorm2d-165          [-1, 300, 14, 14]             600
          Conv2d-166          [-1, 150, 14, 14]          45,000
      Transition-167            [-1, 150, 7, 7]               0
     BatchNorm2d-168            [-1, 150, 7, 7]             300
          Conv2d-169             [-1, 48, 7, 7]           7,200
     BatchNorm2d-170             [-1, 48, 7, 7]              96
          Conv2d-171             [-1, 12, 7, 7]           5,184
      Bottleneck-172            [-1, 162, 7, 7]               0
     BatchNorm2d-173            [-1, 162, 7, 7]             324
          Conv2d-174             [-1, 48, 7, 7]           7,776
     BatchNorm2d-175             [-1, 48, 7, 7]              96
          Conv2d-176             [-1, 12, 7, 7]           5,184
      Bottleneck-177            [-1, 174, 7, 7]               0
     BatchNorm2d-178            [-1, 174, 7, 7]             348
          Conv2d-179             [-1, 48, 7, 7]           8,352
     BatchNorm2d-180             [-1, 48, 7, 7]              96
          Conv2d-181             [-1, 12, 7, 7]           5,184
      Bottleneck-182            [-1, 186, 7, 7]               0
     BatchNorm2d-183            [-1, 186, 7, 7]             372
          Conv2d-184             [-1, 48, 7, 7]           8,928
     BatchNorm2d-185             [-1, 48, 7, 7]              96
          Conv2d-186             [-1, 12, 7, 7]           5,184
      Bottleneck-187            [-1, 198, 7, 7]               0
     BatchNorm2d-188            [-1, 198, 7, 7]             396
          Conv2d-189             [-1, 48, 7, 7]           9,504
     BatchNorm2d-190             [-1, 48, 7, 7]              96
          Conv2d-191             [-1, 12, 7, 7]           5,184
      Bottleneck-192            [-1, 210, 7, 7]               0
     BatchNorm2d-193            [-1, 210, 7, 7]             420
          Conv2d-194             [-1, 48, 7, 7]          10,080
     BatchNorm2d-195             [-1, 48, 7, 7]              96
          Conv2d-196             [-1, 12, 7, 7]           5,184
      Bottleneck-197            [-1, 222, 7, 7]               0
     BatchNorm2d-198            [-1, 222, 7, 7]             444
          Conv2d-199             [-1, 48, 7, 7]          10,656
     BatchNorm2d-200             [-1, 48, 7, 7]              96
          Conv2d-201             [-1, 12, 7, 7]           5,184
      Bottleneck-202            [-1, 234, 7, 7]               0
     BatchNorm2d-203            [-1, 234, 7, 7]             468
          Conv2d-204             [-1, 48, 7, 7]          11,232
     BatchNorm2d-205             [-1, 48, 7, 7]              96
          Conv2d-206             [-1, 12, 7, 7]           5,184
      Bottleneck-207            [-1, 246, 7, 7]               0
     BatchNorm2d-208            [-1, 246, 7, 7]             492
          Conv2d-209             [-1, 48, 7, 7]          11,808
     BatchNorm2d-210             [-1, 48, 7, 7]              96
          Conv2d-211             [-1, 12, 7, 7]           5,184
      Bottleneck-212            [-1, 258, 7, 7]               0
     BatchNorm2d-213            [-1, 258, 7, 7]             516
          Conv2d-214             [-1, 48, 7, 7]          12,384
     BatchNorm2d-215             [-1, 48, 7, 7]              96
          Conv2d-216             [-1, 12, 7, 7]           5,184
      Bottleneck-217            [-1, 270, 7, 7]               0
     BatchNorm2d-218            [-1, 270, 7, 7]             540
          Conv2d-219             [-1, 48, 7, 7]          12,960
     BatchNorm2d-220             [-1, 48, 7, 7]              96
          Conv2d-221             [-1, 12, 7, 7]           5,184
      Bottleneck-222            [-1, 282, 7, 7]               0
     BatchNorm2d-223            [-1, 282, 7, 7]             564
          Conv2d-224             [-1, 48, 7, 7]          13,536
     BatchNorm2d-225             [-1, 48, 7, 7]              96
          Conv2d-226             [-1, 12, 7, 7]           5,184
      Bottleneck-227            [-1, 294, 7, 7]               0
     BatchNorm2d-228            [-1, 294, 7, 7]             588
          Conv2d-229             [-1, 48, 7, 7]          14,112
     BatchNorm2d-230             [-1, 48, 7, 7]              96
          Conv2d-231             [-1, 12, 7, 7]           5,184
      Bottleneck-232            [-1, 306, 7, 7]               0
     BatchNorm2d-233            [-1, 306, 7, 7]             612
          Conv2d-234             [-1, 48, 7, 7]          14,688
     BatchNorm2d-235             [-1, 48, 7, 7]              96
          Conv2d-236             [-1, 12, 7, 7]           5,184
      Bottleneck-237            [-1, 318, 7, 7]               0
     BatchNorm2d-238            [-1, 318, 7, 7]             636
          Conv2d-239             [-1, 48, 7, 7]          15,264
     BatchNorm2d-240             [-1, 48, 7, 7]              96
          Conv2d-241             [-1, 12, 7, 7]           5,184
      Bottleneck-242            [-1, 330, 7, 7]               0
     BatchNorm2d-243            [-1, 330, 7, 7]             660
          Conv2d-244             [-1, 48, 7, 7]          15,840
     BatchNorm2d-245             [-1, 48, 7, 7]              96
          Conv2d-246             [-1, 12, 7, 7]           5,184
      Bottleneck-247            [-1, 342, 7, 7]               0
     BatchNorm2d-248            [-1, 342, 7, 7]             684
          Linear-249                   [-1, 10]           3,430
================================================================
Total params: 768,730
Trainable params: 768,730
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 52.34
Params size (MB): 2.93
Estimated Total Size (MB): 55.27
----------------------------------------------------------------
